In [1]:
In [1]: import pandas as pd
In [2]: import numpy as np
In [3]: import matplotlib.pyplot as plt

In [2]:
In [4]: s = pd.Series([1,3,5,np.nan,6,8])
In [5]: s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
In [6]: dates = pd.date_range('20130101',periods=6)
In [7]: dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
In [8]: df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
In [9]: df

                   A         B         C         D
2013-01-01  0.779643 -0.366079 -0.124508  0.639365
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-04 -0.840434  0.687494  0.012128  1.676062
2013-01-05  0.594956  1.914062 -1.356771 -1.108663
2013-01-06 -0.102192  0.761136  1.176145  1.588427

In [9]:
In [10]: df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## 查看数据

In [21]:
df.head(2)
df.tail(2)

                   A         B         C         D
2013-01-05  0.594956  1.914062 -1.356771 -1.108663
2013-01-06 -0.102192  0.761136  1.176145  1.588427

In [25]:
df.index
df.columns
df.values
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.284869  0.397723 -0.415410  0.609516
std    1.272898  0.913491  1.115914  1.012683
min   -2.590021 -0.512002 -1.995026 -1.108663
25%   -0.655873 -0.299128 -1.068685  0.387582
50%    0.173322  0.294609 -0.164468  0.578531
75%    0.558426  0.742725 -0.022031  1.351162
max    0.779643  1.914062  1.176145  1.676062

In [27]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.779643   -2.590021    0.448837   -0.840434    0.594956   -0.102192
B   -0.366079   -0.098275   -0.512002    0.687494    1.914062    0.761136
C   -0.124508   -0.204429   -1.995026    0.012128   -1.356771    1.176145
D    0.639365    0.517696    0.344211    1.676062   -1.108663    1.588427

In [32]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-01  0.779643 -0.366079 -0.124508  0.639365
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-04 -0.840434  0.687494  0.012128  1.676062
2013-01-05  0.594956  1.914062 -1.356771 -1.108663
2013-01-06 -0.102192  0.761136  1.176145  1.588427

##  选择器

In [39]:
df['C']

2013-01-01   -0.124508
2013-01-02   -0.204429
2013-01-03   -1.995026
2013-01-04    0.012128
2013-01-05   -1.356771
2013-01-06    1.176145
Freq: D, Name: C, dtype: float64

In [41]:
df[0:4]

                   A         B         C         D
2013-01-01  0.779643 -0.366079 -0.124508  0.639365
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-04 -0.840434  0.687494  0.012128  1.676062

In [42]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-04 -0.840434  0.687494  0.012128  1.676062

In [46]:
df
df.loc[dates[1]]

A   -2.590021
B   -0.098275
C   -0.204429
D    0.517696
Name: 2013-01-02 00:00:00, dtype: float64

In [51]:
df.loc[:,['A','B','C','D']]

                   A         B         C         D
2013-01-01  0.779643 -0.366079 -0.124508  0.639365
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-04 -0.840434  0.687494  0.012128  1.676062
2013-01-05  0.594956  1.914062 -1.356771 -1.108663
2013-01-06 -0.102192  0.761136  1.176145  1.588427

In [48]:
df.loc[dates[0],'A']

0.77964267232065021

In [49]:
df.at[dates[0],'A']

0.77964267232065021

In [50]:
df.iloc[3]

A   -0.840434
B    0.687494
C    0.012128
D    1.676062
Name: 2013-01-04 00:00:00, dtype: float64

In [52]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.840434  0.687494
2013-01-05  0.594956  1.914062

In [53]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -2.590021 -0.204429
2013-01-03  0.448837 -1.995026
2013-01-05  0.594956 -1.356771

In [54]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -2.590021 -0.098275 -0.204429  0.517696
2013-01-03  0.448837 -0.512002 -1.995026  0.344211

In [55]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.366079 -0.124508
2013-01-02 -0.098275 -0.204429
2013-01-03 -0.512002 -1.995026
2013-01-04  0.687494  0.012128
2013-01-05  1.914062 -1.356771
2013-01-06  0.761136  1.176145

In [56]:
df.iloc[1,1]

-0.098275238946299512

## 布尔索引

In [57]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.779643 -0.366079 -0.124508  0.639365
2013-01-03  0.448837 -0.512002 -1.995026  0.344211
2013-01-05  0.594956  1.914062 -1.356771 -1.108663

In [58]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.779643       NaN       NaN  0.639365
2013-01-02       NaN       NaN       NaN  0.517696
2013-01-03  0.448837       NaN       NaN  0.344211
2013-01-04       NaN  0.687494  0.012128  1.676062
2013-01-05  0.594956  1.914062       NaN       NaN
2013-01-06       NaN  0.761136  1.176145  1.588427

In [60]:
df2 = df.copy()
df2['E'] = ["one","two","three","four","five","one"]
df2[df2['E'].isin(["one","four"])]

                   A         B         C         D     E
2013-01-01  0.779643 -0.366079 -0.124508  0.639365   one
2013-01-04 -0.840434  0.687494  0.012128  1.676062  four
2013-01-06 -0.102192  0.761136  1.176145  1.588427   one

In [62]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130402',periods=6))
s1

2013-04-02    1
2013-04-03    2
2013-04-04    3
2013-04-05    4
2013-04-06    5
2013-04-07    6
Freq: D, dtype: int64

In [64]:
df.at[dates[0],'A'] = 0

In [79]:
df.loc[:,'D'] = np.array([4]*6)
df

                   A         B         C  D
2013-01-01  0.000000 -0.366079 -0.124508  4
2013-01-02 -2.590021 -0.098275 -0.204429  4
2013-01-03  0.448837 -0.512002 -1.995026  4
2013-01-04 -0.840434  0.687494  0.012128  4
2013-01-05  0.594956  1.914062 -1.356771  4
2013-01-06 -0.102192  0.761136  1.176145  4

In [81]:
In [52]: df2 = df.copy()
In [53]: df2[df2 < 0] = -df2
In [54]: df2

                   A         B         C  D
2013-01-01  0.000000  0.366079  0.124508  4
2013-01-02  2.590021  0.098275  0.204429  4
2013-01-03  0.448837  0.512002  1.995026  4
2013-01-04  0.840434  0.687494  0.012128  4
2013-01-05  0.594956  1.914062  1.356771  4
2013-01-06  0.102192  0.761136  1.176145  4

In [84]:
In [55]: df1 = df.reindex(index=dates[0:4],columns=list(df.columns) + ['E'])
In [56]: df1.loc[dates[0]:dates[2],'E'] = 1
In [57]: df1

                   A         B         C  D    E
2013-01-01  0.000000 -0.366079 -0.124508  4  1.0
2013-01-02 -2.590021 -0.098275 -0.204429  4  1.0
2013-01-03  0.448837 -0.512002 -1.995026  4  1.0
2013-01-04 -0.840434  0.687494  0.012128  4  NaN

In [85]:
In [58]: df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000 -0.366079 -0.124508  4  1.0
2013-01-02 -2.590021 -0.098275 -0.204429  4  1.0
2013-01-03  0.448837 -0.512002 -1.995026  4  1.0

In [86]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000 -0.366079 -0.124508  4  1.0
2013-01-02 -2.590021 -0.098275 -0.204429  4  1.0
2013-01-03  0.448837 -0.512002 -1.995026  4  1.0
2013-01-04 -0.840434  0.687494  0.012128  4  5.0

In [87]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False  False
2013-01-04  False  False  False  False   True

## 运算

In [93]:
df.mean()

A   -0.414809
B    0.397723
C   -0.415410
D    4.000000
dtype: float64

In [95]:
df.mean(1)

2013-01-01    0.877353
2013-01-02    0.276819
2013-01-03    0.485452
2013-01-04    0.964797
2013-01-05    1.288062
2013-01-06    1.458772
Freq: D, dtype: float64

In [100]:
In [63]: s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(1)
In [64]: df.sub(s,axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02 -3.590021 -1.098275 -1.204429  3.0
2013-01-03 -2.551163 -3.512002 -4.995026  1.0
2013-01-04 -5.840434 -4.312506 -4.987872 -1.0
2013-01-05       NaN       NaN       NaN  NaN
2013-01-06 -6.102192 -5.238864 -4.823855 -2.0

In [103]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000 -0.366079 -0.124508   4
2013-01-02 -2.590021 -0.464354 -0.328936   8
2013-01-03 -2.141185 -0.976356 -2.323963  12
2013-01-04 -2.981619 -0.288862 -2.311835  16
2013-01-05 -2.386663  1.625200 -3.668606  20
2013-01-06 -2.488855  2.386336 -2.492460  24